#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/virtualNetworks/vm-sample-lego-project-vnet]
azurerm_public_ip.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/publicIPAddresses/vm-sample-lego-project-pip]
azurerm_network_security_group.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkSecurityGroups/vm-sample-lego-project-nsg]
azurerm_subnet.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/virtualNetworks/vm-sample-lego-project-vnet/subnets/vm-sample-lego-project-subnet]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkInterfaces/vm-sample-lego-project-nic]
azurerm_network_interface_security_group_association.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkInterfaces/vm-sample-lego-project-nic|/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkSecurityGroups/vm-sample-lego-project-nsg]
azurerm_linux_virtual_machine.main: Refreshing state... [id=/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Compute/virtualMachines/vm-sample-lego-project]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_public_ip.main has changed
  ~ resource "azurerm_public_ip" "main" {
        id                      = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/publicIPAddresses/vm-sample-lego-project-pip"
      + ip_address              = "135.225.122.75"
        name                    = "vm-sample-lego-project-pip"
        tags                    = {
            "Environment" = "dev"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_automation_account.vm_snoozing_automation will be created
  + resource "azurerm_automation_account" "vm_snoozing_automation" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "swedencentral"
      + name                          = "vm-sample-lego-project-vm-snoozing-automation"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "vm-sample-lego-project-vm-snoozing-automation"
      + sku_name                      = "Basic"
      + tags                          = {
          + "Environment" = "dev"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_automation_job_schedule.start_vm will be created
  + resource "azurerm_automation_job_schedule" "start_vm" {
      + automation_account_name = "vm-sample-lego-project-vm-snoozing-automation"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "resourcegroupname" = "rg-sample-lego-project"
          + "vmname"            = "vm-sample-lego-project"
        }
      + resource_group_name     = "vm-sample-lego-project-vm-snoozing-automation"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "Start-VM-vm-snoozing-automation"
      + schedule_name           = "Start-VM-Schedule-vm-snoozing-automation"
    }

  # azurerm_automation_job_schedule.stop_vm will be created
  + resource "azurerm_automation_job_schedule" "stop_vm" {
      + automation_account_name = "vm-sample-lego-project-vm-snoozing-automation"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "resourcegroupname" = "rg-sample-lego-project"
          + "vmname"            = "vm-sample-lego-project"
        }
      + resource_group_name     = "vm-sample-lego-project-vm-snoozing-automation"
      + resource_manager_id     = (known after apply)
      + runbook_name            = "Stop-VM-vm-snoozing-automation"
      + schedule_name           = "Stop-VM-Schedule-vm-snoozing-automation"
    }

  # azurerm_automation_runbook.start_vm will be created
  + resource "azurerm_automation_runbook" "start_vm" {
      + automation_account_name = "vm-sample-lego-project-vm-snoozing-automation"
      + content                 = <<-EOT
            param(
                [Parameter(Mandatory=$true)]
                [string]$ResourceGroupName,
                    
                [Parameter(Mandatory=$true)]
                [string]$VMName
            )
            
            try {
                # Connect using Managed Identity
                Connect-AzAccount -Identity
            
                # Start the VM
                Write-Output "Starting VM: $VMName in Resource Group: $ResourceGroupName"
                Start-AzVM -ResourceGroupName $ResourceGroupName -Name $VMName -NoWait
                Write-Output "VM start command issued successfully"
            }
            catch {
                Write-Error "Failed to start VM: $_"
                throw
            }
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "swedencentral"
      + log_progress            = true
      + log_verbose             = false
      + name                    = "Start-VM-vm-snoozing-automation"
      + resource_group_name     = "vm-sample-lego-project-vm-snoozing-automation"
      + runbook_type            = "PowerShell"
      + tags                    = {
          + "Environment" = "dev"
        }
    }

  # azurerm_automation_runbook.stop_vm will be created
  + resource "azurerm_automation_runbook" "stop_vm" {
      + automation_account_name = "vm-sample-lego-project-vm-snoozing-automation"
      + content                 = <<-EOT
            param(
                [Parameter(Mandatory=$true)]
                [string]$ResourceGroupName,
                    
                [Parameter(Mandatory=$true)]
                [string]$VMName
            )
            
            try {
                # Connect using Managed Identity
                Connect-AzAccount -Identity
            
                # Stop the VM (deallocate to avoid charges)
                Write-Output "Stopping VM: $VMName in Resource Group: $ResourceGroupName"
                Stop-AzVM -ResourceGroupName $ResourceGroupName -Name $VMName -Force -NoWait
                Write-Output "VM stop command issued successfully"
            }
            catch {
                Write-Error "Failed to stop VM: $_"
                throw
            }
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "swedencentral"
      + log_progress            = true
      + log_verbose             = false
      + name                    = "Stop-VM-vm-snoozing-automation"
      + resource_group_name     = "vm-sample-lego-project-vm-snoozing-automation"
      + runbook_type            = "PowerShell"
      + tags                    = {
          + "Environment" = "dev"
        }
    }

  # azurerm_automation_schedule.start_vm will be created
  + resource "azurerm_automation_schedule" "start_vm" {
      + automation_account_name = "vm-sample-lego-project-vm-snoozing-automation"
      + expiry_time             = (known after apply)
      + frequency               = "Week"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "Start-VM-Schedule-vm-snoozing-automation"
      + resource_group_name     = "vm-sample-lego-project-vm-snoozing-automation"
      + start_time              = (known after apply)
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # azurerm_automation_schedule.stop_vm will be created
  + resource "azurerm_automation_schedule" "stop_vm" {
      + automation_account_name = "vm-sample-lego-project-vm-snoozing-automation"
      + expiry_time             = (known after apply)
      + frequency               = "Week"
      + id                      = (known after apply)
      + interval                = 1
      + name                    = "Stop-VM-Schedule-vm-snoozing-automation"
      + resource_group_name     = "vm-sample-lego-project-vm-snoozing-automation"
      + start_time              = (known after apply)
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # azurerm_network_security_group.main will be updated in-place
  ~ resource "azurerm_network_security_group" "main" {
        id                  = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project/providers/Microsoft.Network/networkSecurityGroups/vm-sample-lego-project-nsg"
        name                = "vm-sample-lego-project-nsg"
      ~ security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "Environment" = "dev"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_resource_group.vm_snoozing_automation will be created
  + resource "azurerm_resource_group" "vm_snoozing_automation" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "vm-sample-lego-project-vm-snoozing-automation"
      + tags     = {
          + "Environment" = "dev"
        }
    }

  # azurerm_role_assignment.vm_snoozing_automation will be created
  + resource "azurerm_role_assignment" "vm_snoozing_automation" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/806aa371-d708-4fc4-95e9-c2d7879f62db/resourceGroups/rg-sample-lego-project"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + automation_account_id          = (known after apply)
  + automation_account_name        = "vm-sample-lego-project-vm-snoozing-automation"
  + automation_principal_id        = (known after apply)
  + automation_resource_group_name = "vm-sample-lego-project-vm-snoozing-automation"
  + start_vm_runbook_name          = "Start-VM-vm-snoozing-automation"
  + start_vm_schedule_name         = "Start-VM-Schedule-vm-snoozing-automation"
  + stop_vm_runbook_name           = "Stop-VM-vm-snoozing-automation"
  + stop_vm_schedule_name          = "Stop-VM-Schedule-vm-snoozing-automation"
  ~ vm_public_ip                   = "" -> "135.225.122.75"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Copilot, Action: `pull_request`, Workflow: `Terraform Azure Deployment`*